# Liverpool Data Module
## Computational Essay

### Student ID:  xxxxxx

A computational essay

In [12]:
#  Use matplotlib magic to ensure that plots render inline and are saved as part of this notebook
%matplotlib inline

#  Import packages, and assign alias as given by convention
import numpy as np
import pandas as pd
import shapely
import random
import matplotlib as plt
import geopandas as geo
import requests
import seaborn as sns
import json

## Getting the data

House price data downloaded from ONS

In [30]:
#  Read in historic house prices data.  Manually downloaded as a .csv
house = pd.read_csv('house_prices.csv', low_memory = False)

In [38]:
#  Set up a list of variables needed
var = ['LSOA name','LSOA code', 'Local authority code',\
       'Local authority name','Year ending Sep 2016',\
       'Year ending Dec 2016','Year ending Mar 2017',\
       'Year ending Jun 2017']

In [71]:
#  Copy required variables into a new dataframe for analysis
hp = house[var]
hp.head()

,LSOA name,LSOA code,Local authority code,Local authority name,Year ending Sep 2016,Year ending Dec 2016,Year ending Mar 2017,Year ending Jun 2017
0,Hartlepool 008A,E01011950,E06000001,Hartlepool,"26,750","30,000","33,500","35,000"
1,Hartlepool 009A,E01011949,E06000001,Hartlepool,"78,000","90,000","78,000","99,950"
2,Hartlepool 007A,E01011951,E06000001,Hartlepool,"50,000","62,500","65,000","55,500"
3,Hartlepool 002B,E01011953,E06000001,Hartlepool,"65,000","83,250","100,000","55,000"
4,Hartlepool 001A,E01011954,E06000001,Hartlepool,"87,000","85,000","88,500","98,450"

In [72]:
#  View variable types and assess extent of missing data
hp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34856 entries, 0 to 34855
Data columns (total 8 columns):
LSOA name               34753 non-null object
LSOA code               34753 non-null object
Local authority code    34674 non-null object
Local authority name    34753 non-null object
Year ending Sep 2016    34753 non-null object
Year ending Dec 2016    34753 non-null object
Year ending Mar 2017    34753 non-null object
Year ending Jun 2017    34753 non-null object
dtypes: object(8)
memory usage: 2.1+ MB

In [74]:
h = hp.dropna()
h.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 34674 entries, 0 to 34752
Data columns (total 8 columns):
LSOA name               34674 non-null object
LSOA code               34674 non-null object
Local authority code    34674 non-null object
Local authority name    34674 non-null object
Year ending Sep 2016    34674 non-null object
Year ending Dec 2016    34674 non-null object
Year ending Mar 2017    34674 non-null object
Year ending Jun 2017    34674 non-null object
dtypes: object(8)
memory usage: 2.4+ MB

In [75]:
h['LSOA name'].nunique()

34674

In [76]:
h['Local authority name'].nunique()

347

In [77]:
h.groupby('Local authority name')['LSOA name'].nunique()

Local authority name
Adur                             42
Allerdale                        60
Amber Valley                     78
Arun                             94
Ashfield                         74
Ashford                          78
Aylesbury Vale                  115
Babergh                          54
Barking and Dagenham            110
Barnet                          211
Barnsley                        147
Barrow-in-Furness                49
Basildon                        110
Basingstoke and Deane           109
Bassetlaw                        70
Bath and North East Somerset    115
Bedford                         103
Bexley                          146
Birmingham                      639
Blaby                            60
Blackburn with Darwen            91
Blackpool                        94
Blaenau Gwent                    47
Bolsover                         48
Bolton                          177
Boston                           36
Bournemouth                     110
Bracknell Forest                 75
Bradford                        310
Braintree                        87
                               ...
Waveney                          73
Waverley                         82
Wealden                          95
Wellingborough                   47
Welwyn Hatfield                  67
West Berkshire                   97
West Devon                       31
West Dorset                      58
West Lancashire                  73
West Lindsey                     52
West Oxfordshire                 66
West Somerset                    21
Westminster                     128
Weymouth and Portland            38
Wigan                           200
Wiltshire                       285
Winchester                       70
Windsor and Maidenhead           89
Wirral                          206
Woking                           61
Wokingham                        99
Wolverhampton                   158
Worcester                        63
Worthing                         65
Wrexham                          85
Wychavon                         78
Wycombe                         107
Wyre                             69
Wyre Forest                      65
York                            120
Name: LSOA name, Length: 347, dtype: int64

In [78]:
h['Year ending Jun 2017'].describe()

count     34674
unique     4852
top           :
freq        657
Name: Year ending Jun 2017, dtype: object

In [104]:
# To change the pricing data into numeric form
clean1 = lambda p: (p.replace(',',''))
clean2 = lambda p: (p.replace(':','0'))
h['j'] = (h['Year ending Jun 2017'].apply(clean1).apply(clean2))

h['j'].loc[h['j']=='0']=np.NaN

h = h.dropna()

h['j'].astype(float)

0         35000.0
1         99950.0
2         55500.0
3         55000.0
4         98450.0
5         68500.0
6         78000.0
7         58000.0
8         58500.0
9        124950.0
10       317475.0
11       130000.0
12       107000.0
13       116000.0
14       126750.0
15       125000.0
16       201225.0
17       135000.0
18       121250.0
19       131500.0
20       110250.0
21       115000.0
22       131000.0
23       167500.0
24       154950.0
25        27000.0
26        46475.0
27        57500.0
28        73000.0
29        64000.0
           ...
34720    115000.0
34721    143000.0
34722    135000.0
34723     69500.0
34724     80000.0
34725     62000.0
34726    143000.0
34728    142000.0
34729     56000.0
34730     65000.0
34731     51500.0
34732     68500.0
34733     97000.0
34734    119000.0
34735    105000.0
34736     78000.0
34739     82500.0
34740     77000.0
34741     85000.0
34742     89000.0
34743    145000.0
34744     65000.0
34745     82750.0
34746    192500.0
34747    165000.0
34748    125000.0
34749     86000.0
34750     80000.0
34751    110000.0
34752    143475.0
Name: j, Length: 34017, dtype: float64

In [108]:
h['s']=h['Year ending Sep 2016']

In [109]:
h =head()

,LSOA name,LSOA code,Local authority code,Local authority name,Year ending Sep 2016,Year ending Dec 2016,Year ending Mar 2017,Year ending Jun 2017,j,s
0,Hartlepool 008A,E01011950,E06000001,Hartlepool,"26,750","30,000","33,500","35,000",35000,"26,750"
1,Hartlepool 009A,E01011949,E06000001,Hartlepool,"78,000","90,000","78,000","99,950",99950,"78,000"
2,Hartlepool 007A,E01011951,E06000001,Hartlepool,"50,000","62,500","65,000","55,500",55500,"50,000"
3,Hartlepool 002B,E01011953,E06000001,Hartlepool,"65,000","83,250","100,000","55,000",55000,"65,000"
4,Hartlepool 001A,E01011954,E06000001,Hartlepool,"87,000","85,000","88,500","98,450",98450,"87,000"

In [106]:
#  For this to work, need to convert house prices into floats.
h.groupby('Local authority name')['j'].mean()

DataError: No numeric types to aggregate

In [ ]:
#  To look at the variables within the dataframe, and quickly assess the extent of missing data
pd.info()

#  To look at the top lines of the dataframe
pd.head()

#  To look at one variable
pd['variable_name'].head() # View the first 5 rows
pd['variable_name'].tail(10) # View the last 10 rows

#  To list the number of unique values in a variable
pd['variable_name'].unique() # lists the array 
pd['variable_name'].nunique() # gives the number of uniques

#  To set up a dataframe time series of dates, in the pandas datetime format
d = pd.to_datetime(pd['variable_name'])

#  To select out two variables and examine the first few lines of data
df[['variable1','variable2']].head()  # note that this has not been assigned to an object 

#  To set the index and check the first few lines
df.set_index('variable').head()  # not assigned to an object

Querying the dataframe

In [7]:
'''
UNUSED CODE - COULDNT GET API TO WORK
parameters = {'indicator_id':91872,'indicator_id':91812}
#df = requests.get('https://fingertips.phe.org.uk/api/available_data',params=parameters)
parameters

url = 'http://fingertips.phe.org.uk/api/available_data?indicator_id=91872'
r = requests.get(url)

df = json.loads(r.content)
type(df)
len(df)
'''

{'indicator_id': 91812}

In [24]:
"""url = 'https://www.ons.gov.uk/redir/eyJhbGciOiJIUzI1NiJ9.eyJpbmRleCI6MSwicGFnZVNpemUiOjEwLCJwYWdlIjoxLCJ1cmkiOiIvcGVvcGxlcG9wdWxhdGlvbmFuZGNvbW11bml0eS9ob3VzaW5nL2RhdGFzZXRzL2hvdXNlcHJpY2VzdGF0aXN0aWNzZm9yc21hbGxhcmVhcyIsImxpc3RUeXBlIjoicmVsYXRlZGRhdGEifQ.VrtpXT152BZZGLoyxV0SxWBgYmhRg5ax9ZgpTxgM7pU'
df = requests.get(url)
"""

In [23]:
wider = pd.read_csv('wider_health.csv')
wider.head()

,Indicator ID,Indicator Name,Parent Code,Parent Name,Area Code,Area Name,Area Type,Sex,Age,Category Type,...,Upper CI 95.0 limit,Lower CI 99.8 limit,Upper CI 99.8 limit,Count,Denominator,Value note,Recent Trend,Compared to England value or percentiles,Compared to subnational parent value or percentiles,Time period Sortable
0,11401,Rate of complaints about noise,NaN,NaN,E92000001,England,Country,Persons,All ages,NaN,...,7.80271,NaN,NaN,409497.619266,52642452.0,Value is modelled or synthetic estimate,NaN,Not compared,Not compared,20100000
1,11401,Rate of complaints about noise,NaN,NaN,E92000001,England,Country,Persons,All ages,General Practice deprivation deciles in Englan...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Not compared,Not compared,20100000
2,11401,Rate of complaints about noise,NaN,NaN,E92000001,England,Country,Persons,All ages,General Practice deprivation deciles in Englan...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Not compared,Not compared,20100000
3,11401,Rate of complaints about noise,NaN,NaN,E92000001,England,Country,Persons,All ages,General Practice deprivation deciles in Englan...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Not compared,Not compared,20100000
4,11401,Rate of complaints about noise,NaN,NaN,E92000001,England,Country,Persons,All ages,General Practice deprivation deciles in Englan...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Not compared,Not compared,20100000